#coding:utf-8
import datetime
import time

import paho.mqtt.client as mqtt
from pymongo import MongoClient

tableByDate = datetime.datetime.now().strftime("%Y%m")
tableByDateSet = datetime.datetime.now().strftime("%Y%m%d")
# 创建连接
conn = MongoClient('47.95.252.59', 27017)
db = conn["td_EPCXF"]  # 连接mydb数据库，没有则自动创建
my_set = db["t_" + str(tableByDateSet)]  # 使用test_set集合，没有则自动创建
print(my_set)

HOST = "47.95.252.59"
PORT = 61613


def client_loop():
    client_id = time.strftime('%Y%m%d%H%M%S', time.localtime(time.time()))
    client = mqtt.Client(client_id)  # ClientId不能重复，所以使用当前时间
    client.username_pw_set("admin", "password")  # 必须设置，否则会返回「Connected with result code 4」
    client.on_connect = on_connect
    client.on_message = on_message
    client.connect(HOST, PORT, 60)
    client.loop_forever()


def on_connect(client, userdata, flags, rc):
    print("Connected with result code " + str(rc))
    client.subscribe("pubEPCq")


def on_message(client, userdata, msg):
    # print(msg.topic+" "+msg.payload.decode("utf-8"))
    dict_hans = {'1': '1号新风机组水阀阀位反馈', '2': '1号新风机组回风C02', '3': '1号新风机组温01/换热温度', '4': '1号新风机组 风速传感器',
                 '5': '1号新风机组湿01/回风湿度', '6': '1号新风机组温02/回风温度', '7': '1号新风机组湿02/送风湿度', '8': '1号新风机组温03/送风温度',
                 '9': '2号新风机组风速传感器', '10': '2号新风机组温01/换热温度', '11': '2号新风机组水阀阀位反馈', '12': '2号新风机组回风C02',
                 '13': '2号新风机组湿01/回风湿度', '14': '2号新风机组温02/回风温度', '15': '2号新风机组湿02/送风湿度', '16': '2号新风机组温03/送风温度',
                 '17': '3号新风机组风速传感器', '18': '3号新风机组温01/换热温度', '19': '3号新风机组水阀阀位反馈', '20': '3号新风机组回风C02',
                 '21': '3号新风机组湿01/回风湿度', '22': '3号新风机组温02/回风温度', '23': '3号新风机组湿02/送风湿度', '24': '3号新风机组温03/送风温度',
                 '25': '4号新风机组风速传感器', '26': ' 4号新风机组温01/换热温度', '27': ' 4号新风机组水阀阀位反馈', '28': ' 4号新风机组回风C02',
                 '29': ' 4号新风机组湿01/回风湿度', '30': ' 4号新风机组温02/回风温度', '31': ' 4号新风机组湿02/送风湿度', '32': ' 4号新风机组温03/送风温度',
                 '33': ' 5号新风机组风速传感器', '34': '5号新风机组温01/换热温度', '35': '5号新风机组水阀阀位反馈', '36': '5号新风机组回风C02',
                 '37': '5号新风机组湿01/回风湿度', '38': '5号新风机组温02/回风温度', '39': '5号新风机组湿02/送风湿度', '40': '5号新风机组温03/送风温度',
                 '41': '6号新风机组风速传感器', '42': '6号新风机组温01/换热温度', '43': '6号新风机组水阀阀位反馈', '44': '6号新风机组回风C02',
                 '45': '6号新风机组湿01/回风湿度', '46': '6号新风机组温02/回风温度', '47': '6号新风机组湿02/送风湿度', '48': '6号新风机组温03/送风温度',
                 '49': '2号新风机组水阀调节', '50': '3号新风机组水阀调节', '51': '1号新风机组水阀调节', '52': '4号新风机组水阀调节', '53': '5号新风机组水阀调节',
                 '54': '6号新风机组水阀调节', '55': '1号新风机组风阀开关', '56': '1号新风机组风阀开关', '57': '2号新风机组风阀开关', '58': '2号新风机组风阀开关',
                 '59': '3号新风机组风阀开关', '60': '3号新风机组风阀开关', '61': ' 4号新风机组风阀开关', '62': ' 4号新风机组风阀开关', '63': '5号新风机组风阀开关',
                 '64': '5号新风机组风阀开关', '65': '6号新风机组风阀开关', '66': '6号新风机组风阀开关', '67': '1号新风机组压差02/初效DPS',
                 '68': '1号新风机组排风机故障', '69': '1号新风机组排风机手/自动', '70': '1号新风机组排风机状态', '71': '1号新风机组压差01 ',
                 '72': '1号新风机组送风机故障', '73': '1号新风机组送风机手/自动', '74': '1号新风机组压差03 ', '75': '1号新风机组送风机状态',
                 '76': '2号新风机组压差02/初效DPS', '77': '2号新风机组排风机故障', '78': '2号新风机组排风机手/自动', '79': '2号新风机组排风机状态',
                 '80': '2号新风机组压差01 ', '81': '2号新风机组送风机故障', '82': '2号新风机组送风机手/自动', '83': '2号新风机组压差03 ',
                 '84': '2号新风机组送风机状态', '85': '3号新风机组压差02/初效DPS', '86': '3号新风机组排风机故障', '87': '3号新风机组排风机手/自动',
                 '88': '3号新风机组排风机状态', '89': '3号新风机组压差01 ', '90': '3号新风机组送风机故障', '91': '3号新风机组送风机手/自动',
                 '92': '3号新风机组压差03 ', '93': '3号新风机组送风机状态', '94': '4号新风机组压差02/初效DPS', '95': '4号新风机组排风机故障',
                 '96': '4号新风机组排风机手/自动', '97': '4号新风机组排风机状态', '98': '4号新风机组压差01 ', '99': '4号新风机组送风机故障',
                 '100': '4号新风机组送风机手/自动', '101': '4号新风机组压差03 ', '102': '4号新风机组送风机状态', '103': '5号新风机组压差02/初效DPS',
                 '104': '5号新风机组排风机故障', '105': '5号新风机组排风机手/自动', '106': '5号新风机组排风机状态', '107': '5号新风机组压差01 ',
                 '108': '5号新风机组送风机故障', '109': '5号新风机组送风机手/自动', '110': '5号新风机组压差03 ', '111': '5号新风机组送风机状态',
                 '112': '6号新风机组压差02/初效DPS', '113': '6号新风机组排风机故障', '114': '6号新风机组排风机手/自动', '115': '6号新风机组排风机状态',
                 '116': '6号新风机组压差01 ', '117': '6号新风机组送风机故障', '118': '6号新风机组送风机手/自动', '119': '6号新风机组压差03 ',
                 '120': '6号新风机组送风机状态', '121': '1号新风机组加湿阀', '122': '1号新风机组排风机启停', '123': '1号新风机组送风机启停',
                 '124': '2号新风机组加湿阀', '125': '2号新风机组排风机启停', '126': ' 4号新风机组加湿阀', '127': '  4号新风机组排风机启停',
                 '128': ' 4号新风机组送风机启停', '129': '3号新风机组加湿阀', '130': ' 3号新风机组排风机启停', '131': '3号新风机组送风机启停',
                 '132': '5号新风机组加湿阀', '133': ' 5号新风机组排风机启停', '134': '5号新风机组送风机启停', '135': '6号新风机组加湿阀',
                 '136': ' 6号新风机组排风机启停', '137': '6号新风机组送风机启停', '138': '2号新风机组送风机启停', '139': '1号新风机组风阀开关',
                 '140': '1号新风机组风阀开关', '141': '2号新风机组风阀开关', '142': '2号新风机组风阀开关', '143': '3号新风机组风阀开关',
                 '144': '3号新风机组风阀开关', '145': '4号新风机组风阀开关', '146': '4号新风机组风阀开关', '147': '5号新风机组风阀开关',
                 '148': '5号新风机组风阀开关', '149': '6号新风机组风阀开关', '150': '6号新风机组风阀开关'}
    collectionAll = {}
    a = str(msg.payload.decode("utf-8")).split(";")
    for aa in a[0:150]:
        b = aa.split("=")
        collectionAll[b[0]] = b[1]
    collectionAll['createTimeQ'] = datetime.datetime.now().strftime(("%Y-%m-%d %H:%M:%S"))
    my_set.save(collectionAll)

if __name__ == '__main__':
    client_loop()
